Autodesk.Revit.Utility.AssetProperties.Size
Gets the number of the AssetProperty(s) in the object.

Autodesk.Revit.Utility.AssetProperties.default(System.Int32)
Gets the one property that the current object contains with the given index.

Autodesk.Revit.Utility.AssetProperties.default(System.String)
Gets a property by an identifier.
Gets the one property that the current object contains with the given name.

Autodesk.Revit.Utility.AssetProperties
Represents a set of asset property(s).